In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array([10,20,30])

d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(data=mylist) # its numbering from 0 onwards

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=mylist, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(mylist, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
# key label index
salesQ1 = pd.Series(data=[250,450,200,150], index=['USA','China','India','Brazil'])

In [9]:
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [10]:
salesQ2 = pd.Series(data=[260,500,210,100], index=['USA','China','India','Japan'])

In [11]:
salesQ2

USA      260
China    500
India    210
Japan    100
dtype: int64

In [12]:
salesQ2['China']

500

In [13]:
salesQ2

USA      260
China    500
India    210
Japan    100
dtype: int64

In [14]:
#based on Index on Ineteger
salesQ2[0]

260

In [15]:
salesQ2['USA']

260

In [16]:
salesQ2

USA      260
China    500
India    210
Japan    100
dtype: int64

In [17]:
salesQ1[10]

IndexError: index out of bounds

In [18]:
salesQ2['usa']

KeyError: 'usa'

In [19]:
salesQ1 + salesQ2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [20]:
# DataFrame 
import numpy as np
import pandas as pd

In [21]:
columns = ['W','X','Y','Z']

In [22]:
index = ['A','B','C','D','E'] # rows

In [23]:
from numpy.random import randint

In [24]:
data = randint(-100,100,(5,4))

In [25]:
data

array([[-46, -31,  22,  50],
       [-38, -85, -85,  15],
       [-87,  62,  -7, -29],
       [-63, -56, -27, -40],
       [ 49,  58,  18,  51]])

In [26]:
np.random.seed(42)
data = randint(-100, 100,(5,4))

In [27]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [28]:
df = pd.DataFrame(data, index, columns)

In [29]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [30]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
type(df['W'])

pandas.core.series.Series

In [33]:
df[['W','Z','Y']]

    W   Z   Y
A   2 -86  -8
B   6 -80  88
C   2 -13 -26
D  16  51   3
E  30 -99 -48

In [34]:
df['new']

KeyError: 'new'

In [37]:
df['new'] = df['W'] + df['Y']

In [38]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [39]:
# remove column
df.drop('new')

KeyError: "['new'] not found in axis"

In [40]:
df.drop('new',axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [41]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [42]:
df = df.drop('new', axis=1)

In [43]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [44]:
df['A']

KeyError: 'A'

In [45]:
df.loc['A'] # I am looking a row

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [47]:
df.loc[['A', 'B', 'C']]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [48]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [49]:
df.iloc[-1] # last row

W    30
X    49
Y   -48
Z   -99
Name: E, dtype: int32

In [51]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [52]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [53]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [54]:
# I want W & Y from A & C rows
df.loc['A', 'W']

2

In [56]:
# I want W & Y from A & C rows
df.loc[['A','C'], 'W']

A    2
C    2
Name: W, dtype: int32

In [57]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [58]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [59]:
df[df > 0] # help find missing data

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [60]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [61]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [62]:
df[df['X'] > 0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [64]:
df[df['X'] > 0]['W']

A     2
C     2
E    30
Name: W, dtype: int32

In [65]:
(df['W']>0) & (df['Y'] > 1)

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [66]:
df[(df['W']>0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [67]:
(df['W']>0) | (df['Y'] > 1)

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [68]:
df[(df['W']>0) | (df['Y'] > 1)]

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [69]:
# how to reset index value
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [70]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [71]:
new_ind = ['CA','NY','AZ','TX', 'DE']

In [72]:
df['States'] = new_ind

In [73]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     AZ
D  16  -1   3  51     TX
E  30  49 -48 -99     DE

In [74]:
df.set_index('States')

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
AZ       2  21 -26 -13
TX      16  -1   3  51
DE      30  49 -48 -99

In [75]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     AZ
D  16  -1   3  51     TX
E  30  49 -48 -99     DE

In [76]:
df = df.set_index('States')

In [77]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
AZ       2  21 -26 -13
TX      16  -1   3  51
DE      30  49 -48 -99

In [78]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to DE
Data columns (total 4 columns):
W    5 non-null int32
X    5 non-null int32
Y    5 non-null int32
Z    5 non-null int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [81]:
df.dtypes

W    int32
X    int32
Y    int32
Z    int32
dtype: object

In [100]:
# Pandas Missing data NaN Not a Number
import numpy as np
import pandas as pd

df = pd.DataFrame({'A':[1,2, np.nan,4],
                   'B':[5,np.nan,np.nan,8],
                   'C':[10,20,30,10]})

In [83]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  10

In [84]:
df[df>0]

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  10

In [85]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  10

In [86]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  10

In [87]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  10

In [89]:

df.dropna(axis=1, thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  10

In [90]:
0.25 * len(df)

1.0

In [91]:
df.fillna(value='FILL VALUE')

            A           B   C
0           1           5  10
1           2  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  10

In [92]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  10

In [93]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  10

In [94]:
df['A'].fillna(value=0)

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [95]:
df['A'] = df['A'].fillna(value=0)

In [96]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  10

In [97]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [101]:
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  10

In [102]:
# Group BY Functions
# Col1 Col2
# sum, Std, Mean, Count, Max, Min -- etc

import numpy as np
import pandas as pd

In [104]:
df = pd.read_csv('Universities.csv')

FileNotFoundError: [Errno 2] File b'Universities.csv' does not exist: b'Universities.csv'